garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1618.PIC
        <edc:SFRDef edc:access="rnnnnnnn" edc:cname="SSP1CON3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1CON3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01215_mssp_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x217">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SSPCON3"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DHEN" edc:desc="" edc:mask="0x1" edc:name="DHEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AHEN" edc:desc="" edc:mask="0x1" edc:name="AHEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SBCDE" edc:desc="" edc:mask="0x1" edc:name="SBCDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDAHT" edc:desc="" edc:mask="0x1" edc:name="SDAHT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BOEN" edc:desc="" edc:mask="0x1" edc:name="BOEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCIE" edc:desc="" edc:mask="0x1" edc:name="SCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCIE" edc:desc="" edc:mask="0x1" edc:name="PCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKTIM" edc:desc="" edc:mask="0x1" edc:name="ACKTIM" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="5" edc:beginaddr="0x280" edc:endaddr="0x2A0" edc:regionid="sfr5">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x280"/>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="ODCONA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00-000" edc:name="ODCONA" edc:nzwidth="8" edc:por="--00-000" edc:_addr="0x28C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODA0" edc:desc="" edc:mask="0x1" edc:name="ODA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODA1" edc:desc="" edc:mask="0x1" edc:name="ODA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODA2" edc:desc="" edc:mask="0x1" edc:name="ODA2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODA4" edc:desc="" edc:mask="0x1" edc:name="ODA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODA5" edc:desc="" edc:mask="0x1" edc:name="ODA5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="ODCONB" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="ODCONB" edc:nzwidth="8" edc:por="0000----" edc:_addr="0x28D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ODB4" edc:desc="" edc:mask="0x1" edc:name="ODB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB5" edc:desc="" edc:mask="0x1" edc:name="ODB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB6" edc:desc="" edc:mask="0x1" edc:name="ODB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB7" edc:desc="" edc:mask="0x1" edc:name="ODB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCONC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCONC" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x28E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODC0" edc:desc="" edc:mask="0x1" edc:name="ODC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC1" edc:desc="" edc:mask="0x1" edc:name="ODC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC2" edc:desc="" edc:mask="0x1" edc:name="ODC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC3" edc:desc="" edc:mask="0x1" edc:name="ODC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC4" edc:desc="" edc:mask="0x1" edc:name="ODC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC5" edc:desc="" edc:mask="0x1" edc:name="ODC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC6" edc:desc="" edc:mask="0x1" edc:name="ODC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC7" edc:desc="" edc:mask="0x1" edc:name="ODC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x28F"/>
        <edc:JoinedSFRDef edc:cname="CCPR1" edc:desc="" edc:name="CCPR1" edc:nzwidth="0x10" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x291">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x291">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RL" edc:desc="" edc:mask="0xff" edc:name="RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x292">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RH" edc:desc="" edc:mask="0xff" edc:name="RH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CCP1CON" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CCP1CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x293">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="FMT" edc:desc="" edc:mask="0x1" edc:name="FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1MODE" edc:desc="" edc:mask="0xf" edc:name="CCP1MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CCP1FMT" edc:desc="" edc:mask="0x1" edc:name="CCP1FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1OUT" edc:desc="" edc:mask="0x1" edc:name="CCP1OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CCP1EN" edc:desc="" edc:mask="0x1" edc:name="CCP1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP1MODE0" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MODE1" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MODE2" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MODE3" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CCP1CAP" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CCP1CAP" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x294">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTS" edc:desc="" edc:mask="0x7" edc:name="CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CTS0" edc:desc="" edc:mask="0x1" edc:name="CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS1" edc:desc="" edc:mask="0x1" edc:name="CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS2" edc:desc="" edc:mask="0x1" edc:name="CTS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1CTS" edc:desc="" edc:mask="0x7" edc:name="CCP1CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP1CTS0" edc:desc="" edc:mask="0x1" edc:name="CCP1CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1CTS1" edc:desc="" edc:mask="0x1" edc:name="CCP1CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1CTS2" edc:desc="" edc:mask="0x1" edc:name="CCP1CTS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x295"/>
        <edc:JoinedSFRDef edc:cname="CCPR2" edc:desc="" edc:name="CCPR2" edc:nzwidth="0x10" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x298">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x298">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RL" edc:desc="" edc:mask="0xff" edc:name="RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x299">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RH" edc:desc="" edc:mask="0xff" edc:name="RH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CCP2CON" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CCP2CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x29A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="FMT" edc:desc="" edc:mask="0x1" edc:name="FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2MODE" edc:desc="" edc:mask="0xf" edc:name="CCP2MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CCP2FMT" edc:desc="" edc:mask="0x1" edc:name="CCP2FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2OUT" edc:desc="" edc:mask="0x1" edc:name="CCP2OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CCP2EN" edc:desc="" edc:mask="0x1" edc:name="CCP2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP2MODE0" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE1" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE2" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE3" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CCP2CAP" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CCP2CAP" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x29B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTS" edc:desc="" edc:mask="0x7" edc:name="CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CTS0" edc:desc="" edc:mask="0x1" edc:name="CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS1" edc:desc="" edc:mask="0x1" edc:name="CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS2" edc:desc="" edc:mask="0x1" edc:name="CTS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2CTS" edc:desc="" edc:mask="0x7" edc:name="CCP2CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP2CTS0" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2CTS1" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2CTS2" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x29C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPTMRS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCPTMRS" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x29E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1TSEL" edc:desc="" edc:mask="0x3" edc:name="CCP1TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CCP2TSEL" edc:desc="" edc:mask="0x3" edc:name="CCP2TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P3TSEL" edc:desc="" edc:mask="0x3" edc:name="P3TSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="P4TSEL" edc:desc="" edc:mask="0x3" edc:name="P4TSEL" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1TSEL0" edc:desc="" edc:mask="0x1" edc:name="CCP1TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1TSEL1" edc:desc="" edc:mask="0x1" edc:name="CCP1TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2TSEL0" edc:desc="" edc:mask="0x1" edc:name="CCP2TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2TSEL1" edc:desc="" edc:mask="0x1" edc:name="CCP2TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3TSEL0" edc:desc="" edc:mask="0x1" edc:name="P3TSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3TSEL1" edc:desc="" edc:mask="0x1" edc:name="P3TSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P4TSEL0" edc:desc="" edc:mask="0x1" edc:name="P4TSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P4TSEL1" edc:desc="" edc:mask="0x1" edc:name="P4TSEL1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
