garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1618.PIC
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="9" edc:beginaddr="0x480" edc:endaddr="0x4A0" edc:regionid="sfr9">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x480"/>
        <edc:AdjustPoint edc:offset="7" edc:_addr="0x48C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x493">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3L" edc:desc="" edc:mask="0xff" edc:name="TMR3L" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x494">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3H" edc:desc="" edc:mask="0xff" edc:name="TMR3H" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-n-n" edc:cname="T3CON" edc:desc="" edc:impl="0xf5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxx-x-x" edc:name="T3CON" edc:nzwidth="8" edc:por="xxxx-x-x" edc:_addr="0x495">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3ON" edc:desc="" edc:mask="0x1" edc:name="TMR3ON" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T3SYNC" edc:desc="" edc:mask="0x1" edc:name="T3SYNC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T3CKPS" edc:desc="" edc:mask="0x3" edc:name="T3CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR3CS" edc:desc="" edc:mask="0x3" edc:name="TMR3CS" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="T3CKPS0" edc:desc="" edc:mask="0x1" edc:name="T3CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKPS1" edc:desc="" edc:mask="0x1" edc:name="T3CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3CS0" edc:desc="" edc:mask="0x1" edc:name="TMR3CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3CS1" edc:desc="" edc:mask="0x1" edc:name="TMR3CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T3GCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="T3GCON" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x496">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T3GSS" edc:desc="" edc:mask="0x3" edc:name="T3GSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="T3GVAL" edc:desc="" edc:mask="0x1" edc:name="T3GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GGO_nDONE" edc:desc="" edc:mask="0x1" edc:name="T3GGO_nDONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GSPM" edc:desc="" edc:mask="0x1" edc:name="T3GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GTM" edc:desc="" edc:mask="0x1" edc:name="T3GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GPOL" edc:desc="" edc:mask="0x1" edc:name="T3GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3GE" edc:desc="" edc:mask="0x1" edc:name="TMR3GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3GSS0" edc:desc="" edc:mask="0x1" edc:name="T3GSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GSS1" edc:desc="" edc:mask="0x1" edc:name="T3GSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x497"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR5L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR5L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x49A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR5L" edc:desc="" edc:mask="0xff" edc:name="TMR5L" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR5H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR5H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x49B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR5H" edc:desc="" edc:mask="0xff" edc:name="TMR5H" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-n-n" edc:cname="T5CON" edc:desc="" edc:impl="0xf5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxx-x-x" edc:name="T5CON" edc:nzwidth="8" edc:por="xxxx-x-x" edc:_addr="0x49C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR5ON" edc:desc="" edc:mask="0x1" edc:name="TMR5ON" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T5SYNC" edc:desc="" edc:mask="0x1" edc:name="T5SYNC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T5CKPS" edc:desc="" edc:mask="0x3" edc:name="T5CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR5CS" edc:desc="" edc:mask="0x3" edc:name="TMR5CS" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="T5CKPS0" edc:desc="" edc:mask="0x1" edc:name="T5CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKPS1" edc:desc="" edc:mask="0x1" edc:name="T5CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5CS0" edc:desc="" edc:mask="0x1" edc:name="TMR5CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5CS1" edc:desc="" edc:mask="0x1" edc:name="TMR5CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T5GCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="T5GCON" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x49D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T5GSS" edc:desc="" edc:mask="0x3" edc:name="T5GSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="T5GVAL" edc:desc="" edc:mask="0x1" edc:name="T5GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GGO_nDONE" edc:desc="" edc:mask="0x1" edc:name="T5GGO_nDONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GSPM" edc:desc="" edc:mask="0x1" edc:name="T5GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GTM" edc:desc="" edc:mask="0x1" edc:name="T5GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GPOL" edc:desc="" edc:mask="0x1" edc:name="T5GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5GE" edc:desc="" edc:mask="0x1" edc:name="TMR5GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T5GSS0" edc:desc="" edc:mask="0x1" edc:name="T5GSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GSS1" edc:desc="" edc:mask="0x1" edc:name="T5GSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x49E"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="10" edc:beginaddr="0x500" edc:endaddr="0x520" edc:regionid="sfr10">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x500"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="11" edc:beginaddr="0x580" edc:endaddr="0x5A0" edc:regionid="sfr11">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x580"/>
        <edc:JoinedSFRDef edc:cname="PID1SET" edc:desc="" edc:name="PID1SET" edc:nzwidth="0x10" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x58C">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1SETL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1SETL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x58C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1SET0" edc:desc="" edc:mask="0x1" edc:name="PID1SET0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET1" edc:desc="" edc:mask="0x1" edc:name="PID1SET1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET2" edc:desc="" edc:mask="0x1" edc:name="PID1SET2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET3" edc:desc="" edc:mask="0x1" edc:name="PID1SET3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET4" edc:desc="" edc:mask="0x1" edc:name="PID1SET4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET5" edc:desc="" edc:mask="0x1" edc:name="PID1SET5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET6" edc:desc="" edc:mask="0x1" edc:name="PID1SET6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET7" edc:desc="" edc:mask="0x1" edc:name="PID1SET7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SET0" edc:desc="" edc:mask="0x1" edc:name="SET0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET1" edc:desc="" edc:mask="0x1" edc:name="SET1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET2" edc:desc="" edc:mask="0x1" edc:name="SET2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET3" edc:desc="" edc:mask="0x1" edc:name="SET3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET4" edc:desc="" edc:mask="0x1" edc:name="SET4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET5" edc:desc="" edc:mask="0x1" edc:name="SET5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET6" edc:desc="" edc:mask="0x1" edc:name="SET6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET7" edc:desc="" edc:mask="0x1" edc:name="SET7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
