garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1618.PIC
        <edc:JoinedSFRDef edc:cname="PID1K2" edc:desc="" edc:name="PID1K2" edc:nzwidth="0x10" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x592">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1K2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PID1K2L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x592">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1K20" edc:desc="" edc:mask="0x1" edc:name="PID1K20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K21" edc:desc="" edc:mask="0x1" edc:name="PID1K21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K22" edc:desc="" edc:mask="0x1" edc:name="PID1K22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K23" edc:desc="" edc:mask="0x1" edc:name="PID1K23" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K24" edc:desc="" edc:mask="0x1" edc:name="PID1K24" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K25" edc:desc="" edc:mask="0x1" edc:name="PID1K25" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K26" edc:desc="" edc:mask="0x1" edc:name="PID1K26" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K27" edc:desc="" edc:mask="0x1" edc:name="PID1K27" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="K20" edc:desc="" edc:mask="0x1" edc:name="K20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K21" edc:desc="" edc:mask="0x1" edc:name="K21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K22" edc:desc="" edc:mask="0x1" edc:name="K22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K23" edc:desc="" edc:mask="0x1" edc:name="K23" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K24" edc:desc="" edc:mask="0x1" edc:name="K24" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K25" edc:desc="" edc:mask="0x1" edc:name="K25" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K26" edc:desc="" edc:mask="0x1" edc:name="K26" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K27" edc:desc="" edc:mask="0x1" edc:name="K27" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1K2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PID1K2H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x593">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1K28" edc:desc="" edc:mask="0x1" edc:name="PID1K28" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K29" edc:desc="" edc:mask="0x1" edc:name="PID1K29" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K210" edc:desc="" edc:mask="0x1" edc:name="PID1K210" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K211" edc:desc="" edc:mask="0x1" edc:name="PID1K211" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K212" edc:desc="" edc:mask="0x1" edc:name="PID1K212" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K213" edc:desc="" edc:mask="0x1" edc:name="PID1K213" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K214" edc:desc="" edc:mask="0x1" edc:name="PID1K214" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K215" edc:desc="" edc:mask="0x1" edc:name="PID1K215" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="K28" edc:desc="" edc:mask="0x1" edc:name="K28" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K29" edc:desc="" edc:mask="0x1" edc:name="K29" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K210" edc:desc="" edc:mask="0x1" edc:name="K210" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K211" edc:desc="" edc:mask="0x1" edc:name="K211" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K212" edc:desc="" edc:mask="0x1" edc:name="K212" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K213" edc:desc="" edc:mask="0x1" edc:name="K213" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K214" edc:desc="" edc:mask="0x1" edc:name="K214" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K215" edc:desc="" edc:mask="0x1" edc:name="K215" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PID1K3" edc:desc="" edc:name="PID1K3" edc:nzwidth="0x10" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x594">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1K3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PID1K3L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x594">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1K30" edc:desc="" edc:mask="0x1" edc:name="PID1K30" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K31" edc:desc="" edc:mask="0x1" edc:name="PID1K31" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K32" edc:desc="" edc:mask="0x1" edc:name="PID1K32" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K33" edc:desc="" edc:mask="0x1" edc:name="PID1K33" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K34" edc:desc="" edc:mask="0x1" edc:name="PID1K34" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K35" edc:desc="" edc:mask="0x1" edc:name="PID1K35" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K36" edc:desc="" edc:mask="0x1" edc:name="PID1K36" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K37" edc:desc="" edc:mask="0x1" edc:name="PID1K37" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="K30" edc:desc="" edc:mask="0x1" edc:name="K30" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K31" edc:desc="" edc:mask="0x1" edc:name="K31" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K32" edc:desc="" edc:mask="0x1" edc:name="K32" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K33" edc:desc="" edc:mask="0x1" edc:name="K33" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K34" edc:desc="" edc:mask="0x1" edc:name="K34" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K35" edc:desc="" edc:mask="0x1" edc:name="K35" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K36" edc:desc="" edc:mask="0x1" edc:name="K36" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K37" edc:desc="" edc:mask="0x1" edc:name="K37" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1K3H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PID1K3H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x595">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1K38" edc:desc="" edc:mask="0x1" edc:name="PID1K38" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K39" edc:desc="" edc:mask="0x1" edc:name="PID1K39" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K310" edc:desc="" edc:mask="0x1" edc:name="PID1K310" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K311" edc:desc="" edc:mask="0x1" edc:name="PID1K311" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K312" edc:desc="" edc:mask="0x1" edc:name="PID1K312" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K313" edc:desc="" edc:mask="0x1" edc:name="PID1K313" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K314" edc:desc="" edc:mask="0x1" edc:name="PID1K314" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K315" edc:desc="" edc:mask="0x1" edc:name="PID1K315" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="K38" edc:desc="" edc:mask="0x1" edc:name="K38" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K39" edc:desc="" edc:mask="0x1" edc:name="K39" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K310" edc:desc="" edc:mask="0x1" edc:name="K310" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K311" edc:desc="" edc:mask="0x1" edc:name="K311" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K312" edc:desc="" edc:mask="0x1" edc:name="K312" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K313" edc:desc="" edc:mask="0x1" edc:name="K313" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K314" edc:desc="" edc:mask="0x1" edc:name="K314" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K315" edc:desc="" edc:mask="0x1" edc:name="K315" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PID1OUT" edc:desc="" edc:name="PID1OUT" edc:nzwidth="0x28" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x596">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1OUTLL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1OUTLL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x596">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1OUT0" edc:desc="" edc:mask="0x1" edc:name="PID1OUT0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT1" edc:desc="" edc:mask="0x1" edc:name="PID1OUT1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT2" edc:desc="" edc:mask="0x1" edc:name="PID1OUT2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT3" edc:desc="" edc:mask="0x1" edc:name="PID1OUT3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT4" edc:desc="" edc:mask="0x1" edc:name="PID1OUT4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT5" edc:desc="" edc:mask="0x1" edc:name="PID1OUT5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT6" edc:desc="" edc:mask="0x1" edc:name="PID1OUT6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT7" edc:desc="" edc:mask="0x1" edc:name="PID1OUT7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OUT0" edc:desc="" edc:mask="0x1" edc:name="OUT0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT1" edc:desc="" edc:mask="0x1" edc:name="OUT1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT2" edc:desc="" edc:mask="0x1" edc:name="OUT2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT3" edc:desc="" edc:mask="0x1" edc:name="OUT3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT4" edc:desc="" edc:mask="0x1" edc:name="OUT4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT5" edc:desc="" edc:mask="0x1" edc:name="OUT5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT6" edc:desc="" edc:mask="0x1" edc:name="OUT6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT7" edc:desc="" edc:mask="0x1" edc:name="OUT7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1OUTLH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1OUTLH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x597">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1OUT8" edc:desc="" edc:mask="0x1" edc:name="PID1OUT8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT9" edc:desc="" edc:mask="0x1" edc:name="PID1OUT9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT10" edc:desc="" edc:mask="0x1" edc:name="PID1OUT10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT11" edc:desc="" edc:mask="0x1" edc:name="PID1OUT11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT12" edc:desc="" edc:mask="0x1" edc:name="PID1OUT12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT13" edc:desc="" edc:mask="0x1" edc:name="PID1OUT13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT14" edc:desc="" edc:mask="0x1" edc:name="PID1OUT14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT15" edc:desc="" edc:mask="0x1" edc:name="PID1OUT15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OUT8" edc:desc="" edc:mask="0x1" edc:name="OUT8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT9" edc:desc="" edc:mask="0x1" edc:name="OUT9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT10" edc:desc="" edc:mask="0x1" edc:name="OUT10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT11" edc:desc="" edc:mask="0x1" edc:name="OUT11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT12" edc:desc="" edc:mask="0x1" edc:name="OUT12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT13" edc:desc="" edc:mask="0x1" edc:name="OUT13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT14" edc:desc="" edc:mask="0x1" edc:name="OUT14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT15" edc:desc="" edc:mask="0x1" edc:name="OUT15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
