garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1618.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM4DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DC2" edc:desc="" edc:mask="0x1" edc:name="DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC3" edc:desc="" edc:mask="0x1" edc:name="DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC4" edc:desc="" edc:mask="0x1" edc:name="DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC5" edc:desc="" edc:mask="0x1" edc:name="DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC6" edc:desc="" edc:mask="0x1" edc:name="DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC7" edc:desc="" edc:mask="0x1" edc:name="DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC8" edc:desc="" edc:mask="0x1" edc:name="DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC9" edc:desc="" edc:mask="0x1" edc:name="DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM4DC2" edc:desc="" edc:mask="0x1" edc:name="PWM4DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC3" edc:desc="" edc:mask="0x1" edc:name="PWM4DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC4" edc:desc="" edc:mask="0x1" edc:name="PWM4DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC5" edc:desc="" edc:mask="0x1" edc:name="PWM4DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC6" edc:desc="" edc:mask="0x1" edc:name="PWM4DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC7" edc:desc="" edc:mask="0x1" edc:name="PWM4DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC8" edc:desc="" edc:mask="0x1" edc:name="PWM4DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC9" edc:desc="" edc:mask="0x1" edc:name="PWM4DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWMPW2" edc:mask="0x1" edc:name="PWMPW2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW3" edc:mask="0x1" edc:name="PWMPW3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW4" edc:mask="0x1" edc:name="PWMPW4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW5" edc:mask="0x1" edc:name="PWMPW5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW6" edc:mask="0x1" edc:name="PWMPW6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW7" edc:mask="0x1" edc:name="PWMPW7" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW8" edc:mask="0x1" edc:name="PWMPW8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW9" edc:mask="0x1" edc:name="PWMPW9" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn----" edc:cname="PWM4CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00----" edc:name="PWM4CON" edc:nzwidth="8" edc:por="0-00----" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM4POL" edc:desc="" edc:mask="0x1" edc:name="PWM4POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OUT" edc:desc="" edc:mask="0x1" edc:name="PWM4OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4EN" edc:desc="" edc:mask="0x1" edc:name="PWM4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6F0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x680"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x68C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG1DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_cwg_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x691">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1DBR" edc:desc="" edc:mask="0x3f" edc:name="CWG1DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1DBR0" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR1" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR2" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR3" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR4" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR5" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG1DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_cwg_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x692">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF" edc:desc="" edc:mask="0x3f" edc:name="DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1DBF" edc:desc="" edc:mask="0x3f" edc:name="CWG1DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1DBF0" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF1" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF2" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF3" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF4" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF5" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="CWG1AS0" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000101--" edc:name="CWG1AS0" edc:nzwidth="8" edc:por="000101--" edc:_modsrc="DOS-02485_wg_cwg_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x693">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LSAC" edc:desc="" edc:mask="0x3" edc:name="LSAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="LSBD" edc:desc="" edc:mask="0x3" edc:name="LSBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="REN" edc:desc="" edc:mask="0x1" edc:name="REN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SHUTDOWN" edc:desc="" edc:mask="0x1" edc:name="SHUTDOWN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LSAC0" edc:desc="" edc:mask="0x1" edc:name="LSAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSAC1" edc:desc="" edc:mask="0x1" edc:name="LSAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSBD0" edc:desc="" edc:mask="0x1" edc:name="LSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSBD1" edc:desc="" edc:mask="0x1" edc:name="LSBD1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CWG1LSAC" edc:desc="" edc:mask="0x3" edc:name="CWG1LSAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CWG1LSBD" edc:desc="" edc:mask="0x3" edc:name="CWG1LSBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CWG1REN" edc:desc="" edc:mask="0x1" edc:name="CWG1REN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1SHUTDOWN" edc:desc="" edc:mask="0x1" edc:name="CWG1SHUTDOWN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSAC0" edc:desc="" edc:mask="0x1" edc:name="CWG1LSAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSAC1" edc:desc="" edc:mask="0x1" edc:name="CWG1LSAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSBD0" edc:desc="" edc:mask="0x1" edc:name="CWG1LSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSBD1" edc:desc="" edc:mask="0x1" edc:name="CWG1LSBD1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="CWG1AS1" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-000" edc:name="CWG1AS1" edc:nzwidth="8" edc:por="-000-000" edc:_modsrc="DOS-02485_wg_cwg_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x694">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INAS" edc:desc="" edc:mask="0x1" edc:name="INAS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1AS" edc:desc="" edc:mask="0x1" edc:name="C1AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2AS" edc:desc="" edc:mask="0x1" edc:name="C2AS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR2AS" edc:desc="" edc:mask="0x1" edc:name="TMR2AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4AS" edc:desc="" edc:mask="0x1" edc:name="TMR4AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6AS" edc:desc="" edc:mask="0x1" edc:name="TMR6AS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1INAS" edc:desc="" edc:mask="0x1" edc:name="CWG1INAS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1C1AS" edc:desc="" edc:mask="0x1" edc:name="CWG1C1AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1C2AS" edc:desc="" edc:mask="0x1" edc:name="CWG1C2AS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CWG1TMR2AS" edc:desc="" edc:mask="0x1" edc:name="CWG1TMR2AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1TMR4AS" edc:desc="" edc:mask="0x1" edc:name="CWG1TMR4AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1TMR6AS" edc:desc="" edc:mask="0x1" edc:name="CWG1TMR6AS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CWG1OCON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CWG1OCON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02485_wg_cwg_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x695">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRA" edc:desc="" edc:mask="0x1" edc:name="OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRB" edc:desc="" edc:mask="0x1" edc:name="OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRC" edc:desc="" edc:mask="0x1" edc:name="OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRD" edc:desc="" edc:mask="0x1" edc:name="OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1STRA" edc:desc="" edc:mask="0x1" edc:name="CWG1STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRB" edc:desc="" edc:mask="0x1" edc:name="CWG1STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRC" edc:desc="" edc:mask="0x1" edc:name="CWG1STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRD" edc:desc="" edc:mask="0x1" edc:name="CWG1STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRA" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRB" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRC" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRD" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---nnn" edc:cname="CWG1CON0" edc:desc="" edc:impl="0xc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---000" edc:name="CWG1CON0" edc:nzwidth="8" edc:por="00---000" edc:_modsrc="DOS-02485_wg_cwg_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x696">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LD" edc:desc="" edc:mask="0x1" edc:name="LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1EN" edc:desc="" edc:mask="0x1" edc:name="G1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1MODE" edc:desc="" edc:mask="0x7" edc:name="CWG1MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="CWG1LD" edc:desc="" edc:mask="0x1" edc:name="CWG1LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1EN" edc:desc="" edc:mask="0x1" edc:name="CWG1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1MODE0" edc:desc="" edc:mask="0x1" edc:name="CWG1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1MODE1" edc:desc="" edc:mask="0x1" edc:name="CWG1MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1MODE2" edc:desc="" edc:mask="0x1" edc:name="CWG1MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
