garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1618.PIC
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT2CPWU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT2CPWU" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA6">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2CPW" edc:desc="" edc:mask="0xff" edc:name="SMT2CPW" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT2CPW16" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW17" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW18" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW19" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW20" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW21" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW22" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2CPW23" edc:desc="" edc:mask="0x1" edc:name="SMT2CPW23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SMT2PR" edc:desc="" edc:name="SMT2PR" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA7">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT2PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SMT2PRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA7">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2PR" edc:desc="" edc:mask="0xff" edc:name="SMT2PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT2PR0" edc:desc="" edc:mask="0x1" edc:name="SMT2PR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR1" edc:desc="" edc:mask="0x1" edc:name="SMT2PR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR2" edc:desc="" edc:mask="0x1" edc:name="SMT2PR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR3" edc:desc="" edc:mask="0x1" edc:name="SMT2PR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR4" edc:desc="" edc:mask="0x1" edc:name="SMT2PR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR5" edc:desc="" edc:mask="0x1" edc:name="SMT2PR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR6" edc:desc="" edc:mask="0x1" edc:name="SMT2PR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR7" edc:desc="" edc:mask="0x1" edc:name="SMT2PR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT2PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SMT2PRH" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2PR" edc:desc="" edc:mask="0xff" edc:name="SMT2PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT2PR8" edc:desc="" edc:mask="0x1" edc:name="SMT2PR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR9" edc:desc="" edc:mask="0x1" edc:name="SMT2PR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR10" edc:desc="" edc:mask="0x1" edc:name="SMT2PR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR11" edc:desc="" edc:mask="0x1" edc:name="SMT2PR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR12" edc:desc="" edc:mask="0x1" edc:name="SMT2PR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR13" edc:desc="" edc:mask="0x1" edc:name="SMT2PR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR14" edc:desc="" edc:mask="0x1" edc:name="SMT2PR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR15" edc:desc="" edc:mask="0x1" edc:name="SMT2PR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT2PRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SMT2PRU" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDA9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2PR" edc:desc="" edc:mask="0xff" edc:name="SMT2PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT2PR16" edc:desc="" edc:mask="0x1" edc:name="SMT2PR16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR17" edc:desc="" edc:mask="0x1" edc:name="SMT2PR17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR18" edc:desc="" edc:mask="0x1" edc:name="SMT2PR18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR19" edc:desc="" edc:mask="0x1" edc:name="SMT2PR19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR20" edc:desc="" edc:mask="0x1" edc:name="SMT2PR20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR21" edc:desc="" edc:mask="0x1" edc:name="SMT2PR21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR22" edc:desc="" edc:mask="0x1" edc:name="SMT2PR22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2PR23" edc:desc="" edc:mask="0x1" edc:name="SMT2PR23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="SMT2CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="SMT2CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDAA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SMT2PS" edc:desc="" edc:mask="0x3" edc:name="SMT2PS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPOL" edc:desc="" edc:mask="0x1" edc:name="SPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPOL" edc:desc="" edc:mask="0x1" edc:name="WPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STP" edc:desc="" edc:mask="0x1" edc:name="STP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT2PS0" edc:desc="" edc:mask="0x1" edc:name="SMT2PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2PS1" edc:desc="" edc:mask="0x1" edc:name="SMT2PS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="SMT2CON1" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="SMT2CON1" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDAB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="REPEAT" edc:desc="" edc:mask="0x1" edc:name="REPEAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2GO" edc:desc="" edc:mask="0x1" edc:name="SMT2GO" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT2MODE" edc:desc="" edc:mask="0xf" edc:name="SMT2MODE" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SMT2REPEAT" edc:desc="" edc:mask="0x1" edc:name="SMT2REPEAT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT2MODE0" edc:desc="" edc:mask="0x1" edc:name="SMT2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2MODE1" edc:desc="" edc:mask="0x1" edc:name="SMT2MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2MODE2" edc:desc="" edc:mask="0x1" edc:name="SMT2MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2MODE3" edc:desc="" edc:mask="0x1" edc:name="SMT2MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
