garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1618.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC1GLS2" edc:desc="Gate logic select register 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC1GLS2" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF18">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1G3D1N" edc:desc="" edc:mask="0x1" edc:name="LC1G3D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G3D1T" edc:desc="" edc:mask="0x1" edc:name="LC1G3D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G3D2N" edc:desc="" edc:mask="0x1" edc:name="LC1G3D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G3D2T" edc:desc="" edc:mask="0x1" edc:name="LC1G3D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G3D3N" edc:desc="" edc:mask="0x1" edc:name="LC1G3D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G3D3T" edc:desc="" edc:mask="0x1" edc:name="LC1G3D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G3D4N" edc:desc="" edc:mask="0x1" edc:name="LC1G3D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G3D4T" edc:desc="" edc:mask="0x1" edc:name="LC1G3D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="D1N" edc:desc="" edc:mask="0x1" edc:name="D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1T" edc:desc="" edc:mask="0x1" edc:name="D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2N" edc:desc="" edc:mask="0x1" edc:name="D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2T" edc:desc="" edc:mask="0x1" edc:name="D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3N" edc:desc="" edc:mask="0x1" edc:name="D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3T" edc:desc="" edc:mask="0x1" edc:name="D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4N" edc:desc="" edc:mask="0x1" edc:name="D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4T" edc:desc="" edc:mask="0x1" edc:name="D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC1GLS3" edc:desc="Gate logic select register 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC1GLS3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF19">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1G4D1N" edc:desc="" edc:mask="0x1" edc:name="LC1G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G4D1T" edc:desc="" edc:mask="0x1" edc:name="LC1G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G4D2N" edc:desc="" edc:mask="0x1" edc:name="LC1G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G4D2T" edc:desc="" edc:mask="0x1" edc:name="LC1G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G4D3N" edc:desc="" edc:mask="0x1" edc:name="LC1G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G4D3T" edc:desc="" edc:mask="0x1" edc:name="LC1G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G4D4N" edc:desc="" edc:mask="0x1" edc:name="LC1G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G4D4T" edc:desc="" edc:mask="0x1" edc:name="LC1G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="G4D1N" edc:desc="" edc:mask="0x1" edc:name="G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D1T" edc:desc="" edc:mask="0x1" edc:name="G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2N" edc:desc="" edc:mask="0x1" edc:name="G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2T" edc:desc="" edc:mask="0x1" edc:name="G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3N" edc:desc="" edc:mask="0x1" edc:name="G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3T" edc:desc="" edc:mask="0x1" edc:name="G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4N" edc:desc="" edc:mask="0x1" edc:name="G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4T" edc:desc="" edc:mask="0x1" edc:name="G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CLC2CON" edc:desc="Configurable logic cell control" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CLC2CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF1A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC2MODE" edc:desc="" edc:mask="0x7" edc:name="LC2MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="LC2INTN" edc:desc="" edc:mask="0x1" edc:name="LC2INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2INTP" edc:desc="" edc:mask="0x1" edc:name="LC2INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2OUT" edc:desc="" edc:mask="0x1" edc:name="LC2OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LC2EN" edc:desc="" edc:mask="0x1" edc:name="LC2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC2MODE0" edc:desc="" edc:mask="0x1" edc:name="LC2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2MODE1" edc:desc="" edc:mask="0x1" edc:name="LC2MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2MODE2" edc:desc="" edc:mask="0x1" edc:name="LC2MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
